Repository: zipf/perldoc-es
Catalog: tm/work/perlspanish-omegat.explorer.tmx
Source language: en_us
Languages: es_es

source: The C<seek> doesn't change the position, but it I<does> clear the end-of-file condition on the handle, so that the next C<< <FILE> >> makes Perl try again to read something.
es_es: El C<seek> no cambia la posición, pero I<borra> la condición de final de archivo en el identificador de archivo, para que el próximo C<< <FILE> >> haga que Perl intente de nuevo leer algo.

source: =item Fetching user and group info X<user> X<group> X<password> X<uid> X<gid> X<passwd> X</etc/passwd>
es_es: =item Obteniendo información de usuarios y grupos X<user> X<group> X<password> X<uid> X<gid> X<passwd> X</etc/passwd> X<usuario> X<grupo> X<contraseña>

source: They can be used to capture the results of parts of the regexp match for later use.
es_es: se pueden usar para capturar los resultados de partes de una expresión regular a fin de usarlos posteriormente.

source: C<suidperl> is neither built nor installed by default, and has been deprecated since perl 5.8.0.
es_es: C<suidperl> no es construido ni instalado por defecto, y es obsoleto desde perl 5.8.0.

source: You can't use a string literal (or other read-only string) as an argument to C<syscall> because Perl has to assume that any string pointer might be written through.
es_es: No se puede utilizar una cadena literal (u otras cadenas de sólo lectura) como un argumento a C<syscall> porque Perl tiene que asumir que cualquier puntero de cadena puede ser escrita a través de ella.

source: Returns the number of characters sent, or the undefined value on error.
es_es: Devuelve el número de caracteres enviados, o el valor indefinido en caso de error.

source: These built-ins now always operate in "binary" mode (even if sysopen() was passed the O_TEXT flag, or if binmode() was used on the file handle).
es_es: Estos funciones incorporadas, ahora, funcionan siempre en modo "binario" (incluso si se pasó a sysopen() la bandera O_TEXT, o si se utilizó binmode() con el identificador de archivo).

source: The C<HV>'s array of C<HE*>s is now allocated at the correct (minimal) size, thanks to another change by Nicholas Clark.
es_es: El array de C<HV> de los C<HE*> es ahora asignado al correcto (y mínimo) tamaño, gracias a un nuevo cambio de Nicholas Clark.

source: $a += 1; # same as $a = $a + 1
es_es: $a += 1; # igual que $a = $a + 1

source: It is called with a pointer to the stash, and a I<level> of 0.
es_es: Es llamado con un puntero al esquema, y un I<nivel> de 0.

source: my @transformed = map {; ... } @input; # ; disambiguates
es_es: my @transformado = map {; ... } @entrada; # ; desambigüedad

source: If you do not want to call the package's C<import> method (for instance, to stop your namespace from being altered), explicitly supply the empty list:
es_es: Si no desea llamar al método C<import> del paquete (por ejemplo, para impedir que su espacio de nombres sea alterado), indique, de manera explícita, una lista vacía:

source: Document each publically accessible method or subroutine, including params and return values
es_es: Documente cada método públicamente accesible o subrutina, incluyendo parámetros y valores de retorno

source: On systems that support a close-on-exec flag on files, the flag will be set for the newly opened file descriptor, as determined by the value of $^F.
es_es: En sistemas que soportan la bandera cerrar-en-ejecución sobre archivos, la bandera será puesta para el nuevo descriptor de archivo abierto, determinado por el valor de $^F.

source: If you really want to continue using pseudo-hashes but not to see the deprecation warnings, use:
es_es: Si de verdad quiere seguir usando pseudo-hash, pero no quiere ver la advertencia de obsolescencia, utilice:

source: vec($foo, 94, 1) = 1; # 'PerlPerlPerl' # 'l' is "\x6c"
es_es: vec($foo, 94, 1) = 1; # 'PerlPerlPerl' # 'l' es "\x6c"

source: Does exactly the same thing as C<exec LIST>, except that a fork is done first and the parent process waits for the child process to exit.
es_es: Hace exactamente lo mismo que C<exec LISTA>, excepto que se hace primero un fork y el proceso padre espera a que el proceso hijo termine.

source: $in_body = /^$/ ..
es_es: $en_cuerpo = /^$/ ..

source: =head2 Typeglobs and Filehandles X<typeglob> X<filehandle> X<*>
es_es: =head2 Typeglobs e identificadores de archivo X<typeglob> X<filehandle> X<*> X<controlador de archivo>

source: echo hi there
es_es: echo Hola, qué tal

source: If there's an error, returns the undefined value.
es_es: Si hay un error, devuelve el valor indefinido.

source: () Grouping
es_es: () Agrupación

source: =head2 Attempt to set length of freed array
es_es: =head2 Intento de asignar una longitud a un array liberado

source: The additional state of being I<matched with zero-length> is associated with the matched string, and is reset by each assignment to pos().
es_es: El estado adicional de ser I<encontrado con longitud cero> es asociado con la cadena coincidente, y es restablecido con cada asignación de pos().

source: Before Perl 5.14, the assignment to C<$@> occurred before restoration of localised variables, which means that for your code to run on older versions, a temporary is required if you want to mask some but not all errors:
es_es: Antes de Perl 5.14, la asignación a C<$@> ocurría antes de la restauración de las variables localizadas, lo que significa que su código, al ejecutarse en versiones anteriores, requería de una variable temporal si deseaba enmascarar algunos pero no todos los errores:

source: Several special variables also refer back to portions of the previous match.
es_es: Varias variables especiales también se refieren a porciones de la coincidencia anterior.

source: Once the 'aaab' at the start of the string has matched, and the C<(*SKIP)> executed, the next starting point will be where the cursor was when the C<(*SKIP)> was executed.
es_es: Una vez que el 'aaab', en el inicio de la cadena, ha sido encontrado, y el C<(*SKIP)> ejecutado, el siguiente punto de partida será el lugar donde estaba el cursor cuando fue ejecutado C<(*SKIP)>.

source: This change was very prudent because so many Unix vendors already provide a F</usr/bin/perl>, but simultaneously many system utilities may depend on that exact version of Perl, so better not to overwrite it.
es_es: Este cambio fue muy prudente, porque muchos de los instaladores de Unix ya ofrecen un F</usr/bin/perl>, pero al mismo tiempo muchas utilidades del sistema puede depender de la versión exacta de Perl, así que es mejor no sobrescribirlo.

source: If your system supports only the older DBM functions, you may make only one C<dbmopen> call in your program.
es_es: Si su sistema sólo soporta las viejas funciones DBM, sólo puede realizar una llamada C<dbmopen> en su programa.

source: list ops () capture
es_es: ops lista () captura

source: Supplying a count to the I<length-item> format letter is only useful with C<A>, C<a>, or C<Z>.
es_es: Indicando un contador al formato I<longitud-item> solo es útil para C<A>, C<a>, o C<Z>.

source: For threaded builds for modules calling certain re-entrant system calls, binary compatibility was accidentally lost between 5.8.0 and 5.8.1.
es_es: Se perdió, accidentalmente, la compatibilidad binaria entre 5.8.0 y 5.8.1, en la construcción de módulos en paralelo, al llamar a ciertas llamadas del sistema reentrantes.

source: This document describes differences between the 5.10.0 release and the 5.11.0 development release.
es_es: Este documento describe las diferencias entre la versión 5.10.0 y la versión 5.11.0.

source: As C<\d*> can match on an empty string the complete regular expression matched successfully.
es_es: Como C<\d*> puede coincidir con una cadena vacía, la expresión regular completa coincide con éxito.

source: This function causes an immediate core dump.
es_es: Esta función provoca un volcado inmediato del núcleo de ejecución.

source: Lvalue subroutines are again able to return copy-on-write scalars.
es_es: Las subrutinas ivalue pueden, nuevamente, devolver escalares por copia-en-escritura.

source: # same thing, but much more efficiently;
es_es: # lo mismo, pero mucho más eficiente;

source: Trailing spaces are now trimmed from C<$!> and C<$^E>.
es_es: Los espacios finales de C<$!> y C<$^E> ahora son recortados.

source: reset 'a-z'; # reset lower case variables
es_es: reset 'a-z'; # reinicia las variables con minúsculas

source: if (-s $file > 5 + 100 * 2**16) { }
es_es: if (-s $archivo > 5 + 100 * 2**16) { }

source: If the name is given in UTF-8, set this to C<HVhek_UTF8>.
es_es: Si el nombre se da en UTF-8, ponga esto en C<HVhek_UTF8>.

source: jJfFdDpP (The "big end" touches the construct.)
es_es: jJfFdDpP (El "big end" toca la construcción).

source: Editorial adjustments by Gurusamy Sarathy <gsar@ActiveState.com>
es_es: Ajustes editoriales de Gurusamy Sarathy <gsar@ActiveState.com>

source: The workaround is to use global (C<our>) variables.
es_es: La solución consiste en el uso de variables globales (C<our>).

source: my $var; $$variable_name perl.com
es_es: my $var; $$nombre_variable perl.com

source: Now the whatever works:
es_es: Ahora la cosa funciona:

source: For example: when matching C<foo|foot> against "barefoot", only the "foo" part will match, as that is the first alternative tried, and it successfully matches the target string.
es_es: Por ejemplo: cuando se compara C<foo|foot> contra "barefoot", sólo la parte "foo" coincidirá, ya que es la primera alternativa intentada, y coincide de forma exitosa con la cadena objetivo.

source: (This is one of the requirements of C<use strict;>.)
es_es: (Éste es uno de los requisitos de C<use strict;>).

source: 0xdead_beef # more hex
es_es: 0xdead_beef # más hex

source: * unless the delimiter is ''.
es_es: * excepto si el delimitador es ''.

source: Math::Complex not as efficient as POSIX, but POSIX can't work with complex numbers.
es_es: Math::Complex no es tan eficiente como POSIX, pero POSIX no puede trabajar con números complejos.

source: In ASCII the character in the 80th position (indexed from 0) is the letter "P", and in EBCDIC it is the ampersand symbol "&".
es_es: En ASCII el carácter en la posición 80 (basado en 0) es la letra "P", y en EBCDIC es el símbolo del signo "&".

source: This file contains instructions how to build Perl under BeOS and lists known problems.
es_es: Este archivo contiene instrucciones de cómo construir Perl para BeOS y listas de problemas conocidos.

source: C<< (?>pattern) >> does not disable backtracking altogether once it has matched.
es_es: C<< (?>patrón) >> no desactiva la vuelta atrás una vez que ha coincidido.

source: By default sprintf will format the next unused argument in the list, but this allows you to take the arguments out of order:
es_es: Por defecto sprintf formateará el siguiente argumento no utilizado en la lista, pero esto le permite tomar los argumentos fuera de orden:

source: Updated to 3.09.
es_es: Actualizado a 3.09.

source: There's a corresponding C<no> declaration that unimports meanings imported by C<use>, i.e., it calls C<unimport Module LIST> instead of C<import>.
es_es: Existe un correspondiente comando C<no> que des-importa los significados importados por C<use>, es decir, llama a C<unimport Módulo LISTA> en lugar de C<import>.

source: L<DB_File>, L<GDBM_File>, L<NDBM_File>, L<ODBM_File> and L<SDBM_File>.
es_es: L<DB_File>, L<GDBM_File>, L<NDBM_File>, L<ODBM_File> y L<SDBM_File>.

source: use strict; DON'T
es_es: use strict; INCORRECTO

source: because the latter will alternate between returning a filename and returning false.
es_es: ya que este último alternará entre devolver un nombre de archivo y devolver falso.

source: will not automatically invoke the overload method with X as an argument; instead the table above is consulted as normal, and based in the type of X, overloading may or may not be invoked.
es_es: no invocará automáticamente el método sobrecargado con X como argumento; en su lugar, será consultada la tabla anterior, y en base al tipo de X, la sobrecarga será o no invocada.

source: This used to raise a syntax error.
es_es: Esto se usaba para levantar un error de sintaxis.

source: Alpha and MIPS can be either: Digital/Compaq uses (well, used) them in little-endian mode, but SGI/Cray uses them in big-endian mode.
es_es: Alpha y MIPS pueden ser: Digital/Compaq utilizados (bueno usados) en modo I<little-endian>, pero SGI/Cray los usa en modo I<big-endian>.

source: If it has no repeat count or uses a '*', the number of available items is used.
es_es: Si no tiene contador de repeticiones o utiliza un '*', se utiliza el número de elementos disponibles.

source: The C<EXPR> following the modifier is referred to as the "condition".
es_es: La C<EXPR> siguiente al modificador es referida como la "condición".

source: Thus, S<C<split(' ')>> can be used to emulate B<awk>'s default behavior, whereas S<C<split(/ /)>> will give you as many initial null fields (empty string) as there are leading spaces.
es_es: Por lo tanto, S<C<split(' ')>> puede ser utilizado para emular el comportamiento por defecto de B<awk>, mientras que S<C<split(/ /)>> le dará tantos campos nulos iniciales (cadenas vacías) como espacios haya allí.

source: ISBN 0-201-11889-0 [January 1988]
es_es: ISBN 0-201-11889-0 [Enero de 1988]

source: You can truncate an array down to nothing by assigning the null list () to it.
es_es: Puede truncarse un array para dejarlo vacío asignándole la lista nula ().

source: =head2 What mailing lists are there for Perl?
es_es: =head2 ¿Qué listas de correo sobre Perl existen?

source: $ALL_CAPS_HERE constants only (beware clashes with perl vars!)
es_es: $TODO_MAYUSCULAS Sólo constantes (¡cuidado con variables perl!)

source: See L<assertions>.
es_es: Vea L<aserciones>.

source: =head2 Installation
es_es: =head2 Instalación

source: $cnt = tr/*/*/; # count the stars in $_
es_es: $cnt = tr/*/*/; # cuenta los asteriscos en $_

source: =head1 Changes to Existing Documentation
es_es: =head1 Cambios en la documentación actual

source: For example, while searching for closing C<]> paired with the opening C<[>, combinations of C<\\>, C<\]>, and C<\[> are all skipped, and nested C<[> and C<]> are skipped as well.
es_es: Por ejemplo, mientras se busca el C<]> de cierre emparejado con el de apertura C<[>, combinaciones de C<\\>, C<\]> y C<\[> son todos omitidos, y anidados de C<[> y C<]> se pasan también por alto.

source: $setbits = unpack("%32b*", $selectmask);
es_es: $bitspuestos = unpack("%32b*", $mascara);

source: Demands a version of Perl specified by VERSION, or demands some semantics specified by EXPR or by C<$_> if EXPR is not supplied.
es_es: Exige una versión de Perl especificada por VERSIÓN, o exige una semántica especificada por EXPR, o por C<$_> si EXPR se omite.

source: If a pattern does not contain a special backtracking verb that allows an argument, then C<$REGERROR> and C<$REGMARK> are not touched at all.
es_es: Si un patrón no contiene un verbo especial de vuelta atrás que permita un argumento, entonces C<$REGERROR> y C<$REGMARK> no son modificados de ninguna manera.

source: Note that the BSD 4.2 version of C<setpgrp> does not accept any arguments, so only C<setpgrp(0,0)> is portable.
es_es: Tenga en cuenta que la versión de BSD 4.2 de C<setpgrp> no acepta ningún argumento, por lo que sólo C<setpgrp(0,0)> es portátil.

source: Note that the POSIX version of C<getpgrp> does not accept a PID argument, so only C<PID==0> is truly portable.
es_es: Note que la versión POSIX de C<getpgrp> no acepta un argumento PID, por lo que sólo C<PID==0> es verdaderamente portable.

source: Pipes and sockets are now automatically in binary mode.
es_es: Tuberías y I<sockets> están, ahora, automáticamente, en modo binario.

source: - Installing the built perl
es_es: - Instalando el perl compilado

source: For example C<\x{50}> and C<\o{120}> both are the number 80 in decimal, which is less than 256, so the number is interpreted in the native character set encoding.
es_es: Por ejemplo, ambos C<\x{50}> y C<\o{120}> son el número 80 en decimal, que es menos de 256, por lo que el número se interpreta en la codificación de caracteres nativa.

source: Both of these effects take place for the next match, so you can't affect the position with C<pos> during the current match, such as in C<(?{pos() = 5})> or C<s//pos() = 5/e>.
es_es: Estos dos efectos toman lugar en la siguiente coincidencia, por lo que no puede afectar a la posición con C<pos> durante la coincidencia actual, como en C<(?{pos() = 5})> o C<s//pos() = 5/e>.

source: =item no VERSION
es_es: =item no VERSIÓN

source: if ( /$pattern/ ) { }
es_es: if ( /$patron/ ) { }

source: The documentation for the special code blocks (BEGIN, CHECK, INIT, END) has been improved.
es_es: La documentación de los bloques especiales (BEGIN, CHECK, INIT, FIN) ha sido mejorado.

source: It's now only recognized when explicitly turned on (and is then a regular keyword).
es_es: Ahora sólo se reconoce cuando se activa explícitamente (y entonces se considera como una palabra clave normal).

source: On the other hand, with C<Configure -Dprefix=/usr> you can now really replace the Apple-supplied Perl (B<please be careful>).
es_es: Por otro lado, con C<Configure -Dprefix=/usr> ahora puede, realmente, cambiar el Perl suministrado por Apple (B<por favor, tenga cuidado>).

source: The ability to write true lexically scoped pragmas will be introduced, perhaps via a C<pragma> pragma.
es_es: La capacidad de escribir verdaderos pragmas léxicos será indicada, quizás, a través de un pragma C<pragma>.

source: $line = <$fh>;
es_es: $linea = <$fh>;

source: For example, use either
es_es: Por ejemplo, utilice esto

source: Time::HiRes upgraded to version 1.65
es_es: Time::HiRes actualizado a la versión 1.65

source: See L<perlfaq4>.
es_es: Vea L<perlfaq4>.

source: bar # NOT a comment, this slash / terminated m//!
es_es: bar # ¡NO es un comentario, esta barra / termina m//!

source: C<state> declares a lexically scoped variable, just like C<my> does.
es_es: C<state> declara una variable de ámbito léxico, como lo hace C<my>.

source: -c File is a character special file.
es_es: -c Archivo es un archivo especial de caracteres.

source: You shouldn't worry about what this format is, because conversion is automatically done when you decode or encode.
es_es: No tiene que preocuparse por los detalles, ya que la conversión se realiza automáticamente al descodificar y codificar.

source: $output = `cmd 2>/dev/null`;
es_es: $salida = `comando 2>/dev/null`;

source: BITS therefore specifies the number of bits that are reserved for each element in the bit vector.
es_es: BITS, por tanto, especifica el número de bits que son reservados para cada elemento en el vector de bits.

source: =head1 Deprecations
es_es: =head1 Obsolescencias

source: All data in Perl is a scalar, an array of scalars, or a hash of scalars.
es_es: Todo dato en Perl es un escalar, un array de escalares o un hash de escalares

source: =head2 Declaration and Access of Arrays of Arrays
es_es: =head2 Declaración y acceso de los array de array

source: make switching optimization and debugging levels during Perl builds easier via the OPTIMIZE environment variable
es_es: realizar la optimización de conexión y los niveles de depuración durante la compilación de Perl es más fácil usando la variable de entorno OPTIMIZE

source: $shell_info = qx'ps $$'; # that's the new shell's $$
es_es: $shell_info = qx'ps $$'; # es el $$ del nuevo shell

source: C<Pod::Parser> upgraded to version 1.32
es_es: C<Pod::Parser> actualizado a la versión 1.32

source: =head2 Platform-specific enhancements
es_es: =head2 Mejoras específicas por plataforma

source: =head2 Extended Patterns
es_es: =head2 Patrones extendidos

source: You may also use Perl's four-argument version of select() leaving the first three arguments undefined, or you might be able to use the C<syscall> interface to access setitimer(2) if your system supports it.
es_es: Puede también usar la versión de select() de cuatro argumentos, dejando los tres primeros indefinidos, o puede usar la interfaz C<syscall> para acceder a setitimer(2) si su sistema lo soporta.

source: Unary "not" returns the logical negation of the expression to its right.
es_es: Unario "not" devuelve la negación lógica de la expresión a su derecha.

source: All modules should be tested before distribution (using "make disttest"), and the tests should also be available to people installing the modules (using "make test").
es_es: Todos los módulos deben ser probados antes de su distribución (con "make disttest"), y las pruebas también deben estar disponibles para la gente que instala los módulos (con "make test").

source: See also C<keys>, C<values>, and C<sort>.
es_es: Vea también C<keys>, C<values> y C<sort>.

source: Changes the permissions of a list of files.
es_es: Cambia los permisos de una lista de archivos.

source: myfunc(<< "THIS", 23, <<'THAT');
es_es: myfunc(<< "ESTE", 23, <<'ESE');

source: support for Unicode, internationalization, and localization
es_es: compatibilidad con Unicode, internacionalización y localización

source: \*/ # Match the closing delimiter.
es_es: \*/ # Busca el delimitador de cierre.

source: (This is similar to pre-extending an array by assigning a larger number to $#array.) If you say
es_es: (Esto es similar a pre-extender un array asignándole un gran número a $#array). Si dice

source: =item lock THING X<lock>
es_es: =item lock COSA X<lock>

source: \N{U+263D} [4,8] Unicode character (example: FIRST QUARTER MOON)
es_es: \N{U+263D} [4,8] Carácter Unicode (ejemplo: FIRST QUARTER MOON)

source: If instead you want to sort the array @key with the comparison routine C<find_records()> then you can use:
es_es: Si, en cambio, quiere ordenar el array @claves con la rutina de comparación C<busca_registros()> entonces puede usar:

source: It introduced the concept of references, complex data structures, and modules.
es_es: Perl 5 incorpora referencias, estructuras de datos complejas y módulos.

source: This document describes differences between the 5.8.2 release and the 5.8.3 release.
es_es: Este documento describe las diferencias entre la versión 5.8.2 y la versión 5.8.3.

source: Now implements UCA Revision 14 (based on Unicode 4.1.0).
es_es: Ahora implementa la UCA Revisión 14 (basada en Unicode 4.1.0).

source: =head1 Bug Fixes
es_es: =head1 Arreglo de errores

source: as the first line of the handler (see L<perlvar/$^S>).
es_es: como primera línea del gestor (ver L<perlvar/$^S>).

source: A thread's interpreter is now freed after C<< $t->join() >> rather than after C<undef $t>, which should fix some C<ithreads> memory leaks.
es_es: Un intérprete de una hebra es ahora liberado después de un C<< $t->join() >> en lugar de después de C<undef $t>, que debería fijar un poco las pérdidas de memoria de C<ithreads>.

source: On typical hardware, floating point values can store numbers with up to 53 binary digits, and with binary exponents between -1024 and 1024.
es_es: En el hardware típico, los valores de punto flotante pueden almacenar números que tengan hasta 53 dígitos binarios, y con exponentes binarios entre -1024 y 1024.

source: A module which purports to be stable or which hopes to achieve wide use should adhere to as strict a testing regime as possible.
es_es: Un módulo que pretende ser estable o que se espera lograr un uso amplio debe cumplir con un régimen estricto de pruebas tanto como sea posible.

source: eval $x; # CASE 1
es_es: eval $x; # CASO 1

source: =head2 DTrace support
es_es: =head2 Soporte DTrace

source: The repeat count for C<u> is interpreted as the maximal number of bytes to encode per line of output, with 0, 1 and 2 replaced by 45.
es_es: El número de repeticiones para C<u> se interpreta como el número máximo de bytes para codificar por línea de salida, con 0, 1 y 2 sustituidos por 45.</u>
